// Задача 42: 
// Напишите программу, которая будет преобразовывать 
// десятичное число в двоичное. 
// 45 -> 101101 
// 3  -> 11 
// 2  -> 10

// Console.WriteLine("Введите десятичное число "); 
// int num1 = Convert.ToInt32(Console.ReadLine()); 
 
// string MetodPreobr ( int num1) 
// { 
//     int num2 = num1; 
//     string result = ""; 
//     while (num2>0) 
//     { 
//         result =  Convert.ToString(num2%2)+ result; 
//         num2 = num2/2; 
//     } 
//     // Console.WriteLine($" result {result}"); 
//     return result; 
// } 
 
// Console.WriteLine(MetodPreobr(num1));